In [1]:
import pandas as pd
import sqlalchemy as sa
import psycopg2 as ps

In [2]:
from sqlalchemy import create_engine

In [3]:
%load_ext sql

In [4]:
%sql postgresql://postgres:lingga28@localhost:2828/datacamp

In [5]:
conn = create_engine('postgresql://postgres:lingga28@localhost/datacamp')

# 1. Learning to COUNT()
### Exercises
You saw how to use COUNT() in the video. Do you remember what it returns?

Here is a query counting film_id. Select the answer below that correctly describes what the query will return.

SELECT COUNT(film_id) AS count_film_id
FROM reviews;
Run the query in the console to test your theory!

### Possible Answers:
- A. The number of unique films in the reviews table.
- B. The number of records containing a film_id.
- C. The total number of records in the reviews table.
- D. The sum of the film_id field.

Answers: B

# 2. Practice with COUNT()
### Exercises
As you've seen, COUNT(*) tells you how many records are in a table. However, if you want to count the number of non-missing values in a particular field, you can call COUNT() on just that field.

Let's get some practice with COUNT()! You can look at the data in the tables throughout these exercises by clicking on the table name in the console.

### task 1
### Instruction
Count the number of records in the people table, aliasing the result as count_records.

In [9]:
%%sql

-- Count the number of records in the people table
SELECT Count(people) as count_records
FROM cinema.people;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(8397,)]

### task 2
### Instruction
Count the number of records with a birthdate in the people table, aliasing the result as count_birthdate.

In [11]:
%%sql

-- Count the number of birthdates in the people table
SELECT Count(birthdate) as count_birthdate
FROM cinema.people;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(6152,)]

### task 3
### Instruction
Count the languages and countries in the films table; alias as count_languages and count_countries.

In [12]:
%%sql

-- Count the languages and countries represented in the films table
SELECT count(language) AS count_languages, count(country) AS count_countries
FROM cinema.films;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(4957, 4966)]

# 3. SELECT DISTINCT
### Exercises
Often query results will include many duplicate values. You can use the DISTINCT keyword to select the unique values from a field.

This might be useful if, for example, you're interested in knowing which languages are represented in the films table. See if you can find out what countries are represented in this table with the following exercises.

### task 1
### Instruction
Return the unique countries represented in the films table using DISTINCT.

In [15]:
%%sql

-- Return the unique countries from the films table
SELECT DISTINCT country
FROM cinema.films
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[(None,), ('Soviet Union',), ('Indonesia',)]

### task 2
### Instruction
Return the number of unique countries represented in the films table, aliased as count_distinct_countries.

In [17]:
%%sql

-- Count the distinct countries from the films table
SELECT count(DISTINCT country) AS count_distinct_countries
FROM cinema.films;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(64,)]

# 4. Order of execution
### Exercises
SQL code is processed differently than other programming languages in that you need to let the processor know where to pull the data from before making selections.

It's essential to know your code's order of execution to understand what results you'll get from your query and how to fix any errors that may come up.

### Instruction
Drag the SQL keywords into the order that they will be executed in from first (top) to last (bottom).

### Question:
Drag the items below into order
- FROM
- LIMIT
- SELECT

Answer:
- FROM
- SELECT
- LIMIT

# 5. Debugging errors
### Exercises
Debugging is an essential skill for all coders, and it comes from making many mistakes and learning from them.

In this exercise, you'll be given some buggy code that you'll need to fix.

-- Debug this code
SELECT certfication
FROM films
LIMIT 5;

### task 1
### Instruction
Debug and fix the SQL query provided.

In [18]:
%%sql

-- Debug this code
SELECT certification
FROM cinema.films
LIMIT 5;

 * postgresql://postgres:***@localhost:2828/datacamp
5 rows affected.

[('Not Rated',), (None,), ('Not Rated',), ('Not Rated',), ('Not Rated',)]

### task 2
### Instruction
Find the two errors in this code; the same error has been repeated twice.

-- Debug this code
SELECT film_id imdb_score num_votes
FROM reviews;

In [21]:
%%sql

-- Debug this code
SELECT film_id, imdb_score, num_votes
FROM cinema.reviews
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[(3934, 70999999, 203461), (3405, 64000001, 149998), (478, 320000005, 8465)]

### task 3
### Instruction
Find the two bugs in this final query.

-- Debug this code
SELECT COUNNT(birthdate) AS count_birthdays
FROM peeple;

In [22]:
%%sql

-- Debug this code
SELECT COUNT(birthdate) AS count_birthdays
FROM cinema.people;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(6152,)]

# 6. SQL best practices
### Exercises
SQL style guides outline standard best practices for writing code.

This exercise will present several SQL style tips. Your job will be to decide whether they are considered best practices.

We'll be following Holywell's style guide(https://www.sqlstyle.guide/).

### Instruction
Drag and drop the items into the correct zone

### Drag the items into the correct bucket:
- Use underscore in field ames rather than spaces
- Capitalize keywords
- End queris with a semicolon
- Write the query on one line
- Write lots of queries with no semicolon
- Don't capitalize keywords

### Answer:
Best Practice:
- Use underscore in field ames rather than spaces
- Capitalize keywords
- End queris with a semicolon

Poor Practice:
- Write the query on one line
- Write lots of queries with no semicolon
- Don't capitalize keywords

# 7. Formatting
### Exercises
Readable code is highly valued in the coding community and professional settings. Without proper formatting, code and results can be difficult to interpret. You'll often be working with other people that need to understand your code or be able to explain your results, so having a solid formatting habit is essential.

In this exercise, you'll correct poorly written code to better adhere to SQL style standards.

### Instruction
Adjust the sample code so that it is in line with standard practices.

-- Rewrite this query
select person_id, role from roles limit 10

In [25]:
%%sql

-- Rewrite this query
SELECT person_id, role
FROM cinema.roles
LIMIT 10;

 * postgresql://postgres:***@localhost:2828/datacamp
10 rows affected.

[(1630, 'director'),
 (4843, 'actor'),
 (5050, 'actor'),
 (8175, 'actor'),
 (3000, 'director'),
 (4019, 'actor'),
 (5274, 'actor'),
 (7449, 'actor'),
 (1459, 'actor'),
 (3929, 'actor')]

# 7. Non-standard fields
### Exercises
You may occasionally receive a dataset with poorly named fields. Ideally, you would fix these, but you can work around it with some added punctuation in this instance.

A sample query and schema have been provided; imagine you need to be able to run it with a non-standard field name. Select the multiple-choice answer that would correctly fill in the blank to return both a film's id and its number of Facebook likes for all reviews:

SELECT film_id, ___

FROM reviews;

![](1.nonstandardschema.jpg)

### Possible Answers:
- A. facebook likes
- B. "facebook likes"
- C. facebook, likes

Answer: B